---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricSheet
source: html/a07ac1b0-d5b6-ee67-d0c3-30a0d39fba2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricSheet Property

Can't find a host for Fabric Sheet.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceFabricSheet { get; }
```